blog/partsofspeech.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The missing part of existing Audio editors</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/png" href="/images/favicon.png">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Lora:ital,wght@0,400;0,600;1,400&display=swap" rel="stylesheet">
<link rel="stylesheet" href="../blog.css">
</head>
<body>
<div id="content" class="content">
<div class="page-wrap">
<a href="../blog.html" class="back">← all posts</a>
<header class="post-header">
  <span class="post-label">app</span>
  <h1 class="post-title">The missing part of existing Audio editors.</h1>
  <div class="post-meta">
    <span>05 Jul 2026</span>
    <span class="post-meta-sep">·</span>
    <span>6 min read</span>
    <span class="post-meta-sep">·</span>
    <span>vmargb</span>
  </div>
</header>
<div id="outline-container-orgb6c031a" class="outline-2">
<h2 id="orgb6c031a"><a href="https://github.com/vmargb/parts-of-speech">Parts of speech</a> and why the others were not good enough</h2>
<div class="outline-text-2" id="text-orgb6c031a">
<p>
This all began a long time ago when I ran a youtube channel making coding tutorials. It was nothing serious, just simple algorithms, setup &amp; installation videos, repeating labwork into a small video to help me with the exam. Given that I'm not the best speaker nor a conversationalist, the videos would usually operate loosely on a script with a bit of improv. Which for anyone who's done this before, knows that this opens room for a <b>lot</b> of error. Constantly redoing parts, repeating sentences, cutting out all the 'ums and ahhs', annoying breathing or other mouth sounds slipping through. I could make an endless list of all the things that went wrong.
</p>
</div>
<div id="outline-container-orgf8a0a97" class="outline-3">
<h3 id="orgf8a0a97">audacity and other audio editors</h3>
<div class="outline-text-3" id="text-orgf8a0a97">
<p>
The problem isn't that these hiccups happen when recording voice-overs. It's that existing audio editors are unapologetic when you make mistakes. Try re-listening to an hour long recording and fixing a small 10 second segment that you didn't quite like. For the non sound engineer or audacity enthusiast, this becomes a real pain point. Now scale that problem times 100. You have all of these mistakes hovering all over your project timeline, things you didn't notice the first time around. Now we can either exhaustively go through each of these one by one and try our best to repair or impute them, or we can just start over from scratch(something I've done a lot). We could also check each recording is <i>ok</i> before moving onto the next, but this requires messing with the audio timeline constantly, which gets annoying with long-form narrations.
</p>

<p>
Now for me, neither of these are acceptable solutions. I've tried hopping and flipping between different editors: audacity, kdenlive, shotcut, imovie etc,. I really tried to make some of them work, but none of them quite scratch that itch that I wanted to fix.
</p>
</div>
</div>
<div id="outline-container-org0890203" class="outline-3">
<h3 id="org0890203">The Talkback workflow</h3>
<div class="outline-text-3" id="text-org0890203">
<p>
What I was really looking for this whole time was to emulate the environment of a studio recording booth, also known as, <code>talkback</code>. Where a musician in a recording booth works with a moderator that records individual segments or chunks one by one. Each segment is carefully recorded in isolation until its perfect. The moderator listens to the segment and gives real-time feedback to the singer telling them what to change, timing, more emphasis here, change your tone and pitch there etc,. Allowing segments to pass only when its perfected.
</p>

<p>
You <i>can</i> emulate this workflow / loop using existing software, but it's not perfect. Editors are not designed for this workflow. I've tried forcing Audacity to behave this way for a long time and essentially gave up. The problem is that you have to fight with the editor to do things in a <i>talkback way</i>. Which adds mental exhaustion, and when you have a high quantity of repetitions, this exhaustion starts to compound over time, especially for <b>long-form</b> narrations which require a lot of work.
</p>
</div>
</div>
<div id="outline-container-org6fba7d0" class="outline-3">
<h3 id="org6fba7d0">Designing the Backend for Parts of speech</h3>
<div class="outline-text-3" id="text-org6fba7d0">
<p>
Instead of fighting a traditional non-linear editor, I designed the backend of Parts of Speech to strictly enforce the talkback workflow as its core functionality. This no longer makes an open-ended continuous timeline the base, but the data model organizes audio into a <code>Project</code> containing a sequential array of manageable <code>Segments</code>. Each segment is just a self-contained wrapper around audio samples.  
</p>

<p>
So now the talkback workflow is baked directly into the architecture through a finite state machine. The app only holds these finite modes: <code>Idle</code>, <code>Recording</code>, and <code>Reviewing</code>. Now, when you start recording, the incoming microphone data isn't written directly to the project timeline, it's captured in a temporary buffer, which acts as an uncommitted <code>Segment</code>.
</p>
</div>
<div id="outline-container-org0c6842b" class="outline-4">
<h4 id="org0c6842b">The actual workflow</h4>
<div class="outline-text-4" id="text-org0c6842b">
<p>
The moment you stop recording, the state explicitly shifts into <code>Reviewing</code>. You are forced to evaluate the take before moving on, Approve or Reject. If you stumble over a word, you dispatch a <code>Reject</code> command, which simply clears the <code>current</code> buffer and returns you to <code>Idle</code>. If the take is perfect, the <code>Approve</code> command commits the <code>current</code> segment into the main timeline of the <code>Project</code>.  
</p>

<p>
Because the app operates on discrete chunks rather than a continuous waveform, repairing past mistakes becomes computationally simple, as well as being frictionless for the end user. If you re-listen to your project and find a flaw in a previous take, you don't need to <i>surgically slice out the bad audio</i> on a timeline. The backend handles this by just retrying the segment. When you re-record and approve, the new segment cleanly overwrites that previous segment in the array, without the user scrambling around with the audio timeline and fitting things together. You can also squeeze forgotten lines between existing segments by just inserting between them.
</p>

<p>
By strictly separating the audio data into isolated segments and tightly controlling the state transitions, the app naturally guides you through a studio-like recording loop, except you are both the musician and the moderator.
</p>
</div>
</div>
</div>
<div id="outline-container-org1a677f9" class="outline-3">
<h3 id="org1a677f9">Couldn't this just be a plugin?</h3>
<div class="outline-text-3" id="text-org1a677f9">
<p>
This could in theory just be a package you add on top of Audacity or kdenlive. The existing non-linear functions are already present within their architecure, and you <i>could</i> emulate the same state machine loop on top of these editors. However I find that there is an obvious and clear separation of concerns. There is a large difference between getting the audio <i>right</i> and making the audio <i>sound good</i>. Having both of things in the same place can actually get quite messy. Imagine applying your noise reduction, eq, compressor, limiter and then realizing you want to do a take again, ten or twenty takes again?
</p>

<p>
You can fairly argue that this is the users fault and not the software. However, grouping two different use-cases in the same place will naturally lure the average user into this pitfall. Not everyone is an audio-expert or a sound-engineer. I find that you can avoid this problem entirely by splitting the application in two:
</p>

<p>
Get the audio <i>right</i> first, <b>then</b> apply your effects. No room for mistakes.
</p>


<footer class="post-footer">
  <a href="../blog.html">← back to blog</a>
  <span>Published 05 Jul 2026</span>
</footer>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
